# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'gnupg2'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'nvm'

# Apps
cask 'atom'
cask 'charles'
cask 'docker'
cask 'flux'
cask 'google-chrome'
cask 'gpg-suite'
cask 'google-cloud-sdk'
cask 'signal'
cask 'slack'
cask 'spotify'
cask 'tunnelblick'
cask 'virtualbox' # Might need to allow access in Security settings
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
