# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'ansible'
brew 'awscli'
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'gnupg2'
brew 'golang'
brew 'iperf3'
brew 'jq'
brew 'mas' # Mac App Store manager
brew 'mosquitto'
brew 'nvm'
brew 'openssl'
brew 'pinentry-mac'
brew 'yarn'

# Apps
cask 'adoptopenjdk8'
cask 'android-platform-tools'
cask 'android-sdk'
cask 'atom'
cask 'charles'
cask 'docker'
cask 'flux'
cask 'google-chrome'
cask 'gpg-suite'
cask 'google-cloud-sdk'
cask 'jetbrains-toolbox'
cask 'signal'
cask 'slack'
cask 'spotify'
cask 'tunnelblick'
cask 'visual-studio-code'

# Fonts
cask 'font-jetbrains-mono'

# Drivers
cask 'logitech-options'
cask 'yubico-authenticator'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Xcode', id: 497799835
mas 'tailscale', id: 1475387142
